### Deal with missing values

In [70]:
import pandas as pd
import numpy as np

In [76]:
#df = pd.read_csv('data.txt',header=None,names=['name','marks','location'])
df = pd.read_csv('data.txt',header=None,names=['name','marks','location'],na_values=[' ','*'])
#df1 = pd.read_csv('income.csv')

In [77]:
df

    name  marks location
0   ravi    NaN        d
1    kbc    NaN        p
2    NaN   56.0        k
3  mohan    NaN        r

In [73]:
df.marks[0]

' '

In [25]:
#df.replace({'?':np.nan,'*':np.nan},inplace=True)

In [26]:
df

    name  marks location
0   ravi   34.0        d
1    kbc    NaN        p
2    NaN   56.0        k
3  mohan    NaN        r

In [ ]:
### check for missing data columns wise

In [27]:
df.isnull().sum()

name        1
marks       2
location    0
dtype: int64

In [28]:
df.dtypes

name         object
marks       float64
location     object
dtype: object

In [16]:
#df.replace({np.nan:0},inplace=True)

In [17]:
#df['marks'] = df.marks.astype('int')

In [29]:
#df.marks

In [32]:
### fillna

#df.fillna(7)

#df.fillna({'name':'john','marks':20})

df.fillna({'name':'john','marks':df.marks.mean()},inplace=True)

#df.fillna({'name':'john','marks':df.marks.median()})

#df['marks'] = df.marks.replace({0:df.marks.mean()})

In [33]:
df

    name  marks location
0   ravi   34.0        d
1    kbc   45.0        p
2   john   56.0        k
3  mohan   45.0        r

In [34]:
### load a csv file

In [59]:
df1 = pd.read_csv('train.csv')

In [60]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [61]:
df1.shape

(891, 12)

In [62]:
df1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [63]:
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [64]:
df1.Age.agg(['mean','median'])

mean      29.699118
median    28.000000
Name: Age, dtype: float64

In [65]:
df1.fillna({'Age':df1.Age.median(),'Embarked':df1.Embarked.mode()[0]},inplace=True)

In [66]:
df1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [46]:
#df1[df1.Cabin.isnull()]

In [67]:
df3 = df1.dropna()

In [68]:
df3.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [49]:
### drop missing data only from a specific col

In [50]:
df1.dropna(subset=['Cabin'],inplace=True)

In [51]:
df1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [52]:
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [53]:
df1.Embarked.value_counts()

S    129
C     69
Q      4
Name: Embarked, dtype: int64

In [56]:
mode = df1.Embarked.mode()[0]
mode

'S'

In [57]:
df1.fillna({'Embarked':mode},inplace=True)

In [58]:
df1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [69]:
#isnull()
#fillna()
#dropna()